# Exercise Walk-Through

# Table of Contents 

1. Importing and checking data sets
2. Checking for missing values and duplicates
3. Checking data sets 
4. Merging data sets 
5. Exporting data

### 1. Importing and checking data sets

In [1]:
# Import libraries

import pandas as pd
import numpy as np
import os

In [2]:
# Create project folder string

path = r'/Users/nora/Desktop/Instacart Basket Analysis'

In [3]:
# Import orders.csv

df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_cleaned.csv'), index_col = False)

In [4]:
df_ords.shape

(3421083, 9)

In [5]:
# Import order_products_prior.csv

df_ords_prior = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'order_products__prior.csv'), index_col = False)

### 2. Checking for missing values and duplicates

In [7]:
# Check for missing values

df_ords_prior.isnull().sum() # No missing values

order_id             0
product_id           0
add_to_cart_order    0
reordered            0
dtype: int64

In [9]:
# Check for duplicates 

df_dups = df_ords_prior[df_ords_prior.duplicated()]

In [10]:
df_dups # No duplicates

Empty DataFrame
Columns: [order_id, product_id, add_to_cart_order, reordered]
Index: []

### 3. Checking data sets

In [6]:
# Check the data sets

df_ords.head()

,Unnamed: 0,Unnamed: 0.1,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,first_order
0,0,0,2539329,1,1,2,8,NaN,True
1,1,1,2398795,1,2,3,7,15.0,False
2,2,2,473747,1,3,3,12,21.0,False
3,3,3,2254736,1,4,4,7,29.0,False
4,4,4,431534,1,5,4,15,28.0,False

In [7]:
df_ords_prior.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [8]:
# Check the dimensions of the data frames

df_ords_prior.shape

(32434489, 4)

In [9]:
df_ords.shape

(3421083, 9)

### 4. Merging data sets

In [10]:
# Merge df_ords and df_ords_prior on the product_id column

df_merged_large = df_ords.merge(df_ords_prior, on = 'order_id', indicator = True)

In [11]:
# Check the merged data

df_merged_large.head()

,Unnamed: 0,Unnamed: 0.1,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,first_order,product_id,add_to_cart_order,reordered,_merge
0,0,0,2539329,1,1,2,8,NaN,True,196,1,0,both
1,0,0,2539329,1,1,2,8,NaN,True,14084,2,0,both
2,0,0,2539329,1,1,2,8,NaN,True,12427,3,0,both
3,0,0,2539329,1,1,2,8,NaN,True,26088,4,0,both
4,0,0,2539329,1,1,2,8,NaN,True,26405,5,0,both

In [12]:
# Count values in _merge column

df_merged_large['_merge'].value_counts()

both          32434489
left_only            0
right_only           0
Name: _merge, dtype: int64

In [13]:
# Check for full match using outer merge

df_merged_large_outer = df_ords.merge(df_ords_prior, on = 'order_id', indicator = True, how = 'outer')

In [14]:
df_merged_large_outer['_merge'].value_counts()

both          32434489
left_only       206209
right_only           0
Name: _merge, dtype: int64

### 5. Exporting data

In [62]:
# 2. Export the merged file in pickle format as “orders_products_combined.pkl”.

df_merged_large.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_combined.pkl'))

In [63]:
# Check the shape of the exported data set

df_merged_large.shape

(32434489, 13)